; domain
(define (domain reverse-folding)
(:requirements :adl :action-costs :fluents)

(:types
    node - object
    coord - object
    direction - object
    rotation - object
)

(:constants
    left right up down - direction
    clockwise counterclockwise - rotation
)

(:predicates
    ;; ?dfrom rotated by ?r ends up as ?d2to
    (NEXT-DIRECTION ?dfrom - direction ?r - rotation ?d2to - direction)
    ;; ?cnext = ?c + 1
    (COORD-INC ?c ?cnext - coord)
    ;; Last node of the string
    (END-NODE ?n - node)
    ;; ?n2 follows right after ?n1 in the string
    (CONNECTED ?n1 ?n2 - node)

    ;; Position of the node in the grid
    (at ?n - node ?x ?y - coord)
    ;; Heading of the outgoing edge of this node
    (heading ?n - node ?dir - direction)
    ;; The coordinates are not occupied by any node
    (free ?x ?y - coord)
    ;; Flag indicating we are in the process of rotating the string
    (rotating)
    ;; Cursor storing that ?nstart was rotated by ?r and the next node to
    ;; process is ?n
    (node-first-pass-next ?nstart - node ?r - rotation ?n - node)
    ;; Cursor for the second pass
    (node-second-pass-next ?n - node)
)

(:functions
    (total-cost) - number
    (rotate-cost) - number
    (update-cost) - number
)


;; Rotates the string after this node and start the first pass computing
;; absolute directions and coordinates of other nodes
(:action rotate
    :parameters (?n - node ?r - rotation ?fromdir ?todir - direction)
    :precondition
        (and
            (not (rotating))
            (NEXT-DIRECTION ?fromdir ?r ?todir)
            (heading ?n ?fromdir)
        )
    :effect
        (and
            (not (heading ?n ?fromdir))
            (heading ?n ?todir)
            (rotating)
            (node-first-pass-next ?n ?r ?n)
            (increase (total-cost) (rotate-cost))
        )
)

;; The first pass fixes the direction of nodes and removes all (at ...) facts
(:action rotate-first-pass
    :parameters (?nstart - node ?r - rotation
                 ?n1 - node
                 ?n2 - node ?n2x ?n2y - coord ?n2dir ?n2setdir - direction)
    :precondition
        (and
            (CONNECTED ?n1 ?n2)
            (NEXT-DIRECTION ?n2dir ?r ?n2setdir)
            (node-first-pass-next ?nstart ?r ?n1)
            (at ?n2 ?n2x ?n2y)
            (heading ?n2 ?n2dir)
        )
    :effect
        (and
            (not (node-first-pass-next ?nstart ?r ?n1))
            (node-first-pass-next ?nstart ?r ?n2)
            (not (at ?n2 ?n2x ?n2y))
            (free ?n2x ?n2y)
            (not (heading ?n2 ?n2dir))
            (heading ?n2 ?n2setdir)
            (increase (total-cost) (update-cost))
        )
)

(:action rotate-first-pass-end
    :parameters (?nstart - node ?r - rotation
                 ?n1 - node
                 ?n2 - node ?n2x ?n2y - coord)
    :precondition
        (and
            (END-NODE ?n2)
            (CONNECTED ?n1 ?n2)
            (node-first-pass-next ?nstart ?r ?n1)
            (at ?n2 ?n2x ?n2y)
        )
    :effect
        (and
            (not (at ?n2 ?n2x ?n2y))
            (free ?n2x ?n2y)
            (not (node-first-pass-next ?nstart ?r ?n1))
            (node-second-pass-next ?nstart)
            (increase (total-cost) (update-cost))
        )
)

;; The second pass sets the coordinates of all nodes depending on the
;; direction
(:action rotate-second-pass
    :parameters (?n1 - node ?n1x ?n1y - coord ?n1dir - direction
                 ?n2 - node ?n2x ?n2y - coord)
    :precondition
        (and
            (CONNECTED ?n1 ?n2)
            (node-second-pass-next ?n1)
            (at ?n1 ?n1x ?n1y)
            (heading ?n1 ?n1dir)
            (free ?n2x ?n2y)

            (or
                (and (= ?n1dir up)
                     (= ?n1x ?n2x)
                     (COORD-INC ?n1y ?n2y)
                )

                (and (= ?n1dir down)
                     (= ?n1x ?n2x)
                     (COORD-INC ?n2y ?n1y)
                )

                (and (= ?n1dir left)
                     (= ?n1y ?n2y)
                     (COORD-INC ?n2x ?n1x)
                )

                (and (= ?n1dir right)
                     (= ?n1y ?n2y)
                     (COORD-INC ?n1x ?n2x)
                )
            )
        )
    :effect
        (and
            (not (node-second-pass-next ?n1))
            (node-second-pass-next ?n2)
            (not (free ?n2x ?n2y))
            (at ?n2 ?n2x ?n2y)
            (increase (total-cost) (update-cost))
        )
)

(:action rotate-second-pass-end
    :parameters (?n - node)
    :precondition
        (and
            (END-NODE ?n)
            (node-second-pass-next ?n)
        )
    :effect
        (and
            (not (node-second-pass-next ?n))
            (not (rotating))
            (increase (total-cost) (update-cost))
        )
)

)

; problem
;; .-.
;; | |
;; . .-.
;; |   |
;; x   .-.
(define (problem reverse-folding-asp-8-5-431814)
(:domain reverse-folding)

(:objects
    n1 n2 n3 n4 n5 n6 n7 n8 - node
    c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 - coord
)
(:init
    (NEXT-DIRECTION up clockwise right)
    (NEXT-DIRECTION up counterclockwise left)
    (NEXT-DIRECTION down clockwise left)
    (NEXT-DIRECTION down counterclockwise right)
    (NEXT-DIRECTION left clockwise up)
    (NEXT-DIRECTION left counterclockwise down)
    (NEXT-DIRECTION right clockwise down)
    (NEXT-DIRECTION right counterclockwise up)

    (COORD-INC c1 c2)
    (COORD-INC c2 c3)
    (COORD-INC c3 c4)
    (COORD-INC c4 c5)
    (COORD-INC c5 c6)
    (COORD-INC c6 c7)
    (COORD-INC c7 c8)
    (COORD-INC c8 c9)
    (COORD-INC c9 c10)
    (COORD-INC c10 c11)
    (COORD-INC c11 c12)
    (COORD-INC c12 c13)
    (COORD-INC c13 c14)
    (COORD-INC c14 c15)

    (CONNECTED n1 n2)
    (CONNECTED n2 n3)
    (CONNECTED n3 n4)
    (CONNECTED n4 n5)
    (CONNECTED n5 n6)
    (CONNECTED n6 n7)
    (CONNECTED n7 n8)
    (END-NODE n8)

    (at n1 c8 c8)
    (at n2 c8 c9)
    (at n3 c8 c10)
    (at n4 c8 c11)
    (at n5 c8 c12)
    (at n6 c8 c13)
    (at n7 c8 c14)
    (at n8 c8 c15)
    (heading n1 up)
    (heading n2 up)
    (heading n3 up)
    (heading n4 up)
    (heading n5 up)
    (heading n6 up)
    (heading n7 up)
    (free c1 c1)
    (free c1 c2)
    (free c1 c3)
    (free c1 c4)
    (free c1 c5)
    (free c1 c6)
    (free c1 c7)
    (free c1 c8)
    (free c1 c9)
    (free c1 c10)
    (free c1 c11)
    (free c1 c12)
    (free c1 c13)
    (free c1 c14)
    (free c1 c15)
    (free c2 c1)
    (free c2 c2)
    (free c2 c3)
    (free c2 c4)
    (free c2 c5)
    (free c2 c6)
    (free c2 c7)
    (free c2 c8)
    (free c2 c9)
    (free c2 c10)
    (free c2 c11)
    (free c2 c12)
    (free c2 c13)
    (free c2 c14)
    (free c2 c15)
    (free c3 c1)
    (free c3 c2)
    (free c3 c3)
    (free c3 c4)
    (free c3 c5)
    (free c3 c6)
    (free c3 c7)
    (free c3 c8)
    (free c3 c9)
    (free c3 c10)
    (free c3 c11)
    (free c3 c12)
    (free c3 c13)
    (free c3 c14)
    (free c3 c15)
    (free c4 c1)
    (free c4 c2)
    (free c4 c3)
    (free c4 c4)
    (free c4 c5)
    (free c4 c6)
    (free c4 c7)
    (free c4 c8)
    (free c4 c9)
    (free c4 c10)
    (free c4 c11)
    (free c4 c12)
    (free c4 c13)
    (free c4 c14)
    (free c4 c15)
    (free c5 c1)
    (free c5 c2)
    (free c5 c3)
    (free c5 c4)
    (free c5 c5)
    (free c5 c6)
    (free c5 c7)
    (free c5 c8)
    (free c5 c9)
    (free c5 c10)
    (free c5 c11)
    (free c5 c12)
    (free c5 c13)
    (free c5 c14)
    (free c5 c15)
    (free c6 c1)
    (free c6 c2)
    (free c6 c3)
    (free c6 c4)
    (free c6 c5)
    (free c6 c6)
    (free c6 c7)
    (free c6 c8)
    (free c6 c9)
    (free c6 c10)
    (free c6 c11)
    (free c6 c12)
    (free c6 c13)
    (free c6 c14)
    (free c6 c15)
    (free c7 c1)
    (free c7 c2)
    (free c7 c3)
    (free c7 c4)
    (free c7 c5)
    (free c7 c6)
    (free c7 c7)
    (free c7 c8)
    (free c7 c9)
    (free c7 c10)
    (free c7 c11)
    (free c7 c12)
    (free c7 c13)
    (free c7 c14)
    (free c7 c15)
    (free c8 c1)
    (free c8 c2)
    (free c8 c3)
    (free c8 c4)
    (free c8 c5)
    (free c8 c6)
    (free c8 c7)
    (free c9 c1)
    (free c9 c2)
    (free c9 c3)
    (free c9 c4)
    (free c9 c5)
    (free c9 c6)
    (free c9 c7)
    (free c9 c8)
    (free c9 c9)
    (free c9 c10)
    (free c9 c11)
    (free c9 c12)
    (free c9 c13)
    (free c9 c14)
    (free c9 c15)
    (free c10 c1)
    (free c10 c2)
    (free c10 c3)
    (free c10 c4)
    (free c10 c5)
    (free c10 c6)
    (free c10 c7)
    (free c10 c8)
    (free c10 c9)
    (free c10 c10)
    (free c10 c11)
    (free c10 c12)
    (free c10 c13)
    (free c10 c14)
    (free c10 c15)
    (free c11 c1)
    (free c11 c2)
    (free c11 c3)
    (free c11 c4)
    (free c11 c5)
    (free c11 c6)
    (free c11 c7)
    (free c11 c8)
    (free c11 c9)
    (free c11 c10)
    (free c11 c11)
    (free c11 c12)
    (free c11 c13)
    (free c11 c14)
    (free c11 c15)
    (free c12 c1)
    (free c12 c2)
    (free c12 c3)
    (free c12 c4)
    (free c12 c5)
    (free c12 c6)
    (free c12 c7)
    (free c12 c8)
    (free c12 c9)
    (free c12 c10)
    (free c12 c11)
    (free c12 c12)
    (free c12 c13)
    (free c12 c14)
    (free c12 c15)
    (free c13 c1)
    (free c13 c2)
    (free c13 c3)
    (free c13 c4)
    (free c13 c5)
    (free c13 c6)
    (free c13 c7)
    (free c13 c8)
    (free c13 c9)
    (free c13 c10)
    (free c13 c11)
    (free c13 c12)
    (free c13 c13)
    (free c13 c14)
    (free c13 c15)
    (free c14 c1)
    (free c14 c2)
    (free c14 c3)
    (free c14 c4)
    (free c14 c5)
    (free c14 c6)
    (free c14 c7)
    (free c14 c8)
    (free c14 c9)
    (free c14 c10)
    (free c14 c11)
    (free c14 c12)
    (free c14 c13)
    (free c14 c14)
    (free c14 c15)
    (free c15 c1)
    (free c15 c2)
    (free c15 c3)
    (free c15 c4)
    (free c15 c5)
    (free c15 c6)
    (free c15 c7)
    (free c15 c8)
    (free c15 c9)
    (free c15 c10)
    (free c15 c11)
    (free c15 c12)
    (free c15 c13)
    (free c15 c14)
    (free c15 c15)

    (= (total-cost) 0)
    (= (rotate-cost) 1)
    (= (update-cost) 0)
)
(:goal
    (and
        (at n1 c8 c8)
        (at n2 c8 c9)
        (at n3 c8 c10)
        (at n4 c9 c10)
        (at n5 c9 c9)
        (at n6 c10 c9)
        (at n7 c10 c8)
        (at n8 c11 c8)
        (not (rotating))
    )
)
(:metric minimize (total-cost))
)

; plan
1. (rotate n3 clockwise up right)
   deleted: (heading n3 up)
   added: (heading n3 right) (rotating) (node-first-pass-next n3 clockwise n3)
   goals met: 3 of 9
2. (rotate-first-pass n3 clockwise n3 n4 c8 c11 up right)
   deleted: (node-first-pass-next n3 clockwise n3) (at n4 c8 c11) (heading n4 up)
   added: (node-first-pass-next n3 clockwise n4) (free c8 c11) (heading n4 right)
   goals met: 3 of 9
3. (rotate-first-pass n3 clockwise n4 n5 c8 c12 up right)
   deleted: (node-first-pass-next n3 clockwise n4) (at n5 c8 c12) (heading n5 up)
   added: (node-first-pass-next n3 clockwise n5) (free c8 c12) (heading n5 right)
   goals met: 3 of 9
4. (rotate-first-pass n3 clockwise n5 n6 c8 c13 up right)
   deleted: (node-first-pass-next n3 clockwise n5) (at n6 c8 c13) (heading n6 up)
   added: (node-first-pass-next n3 clockwise n6) (free c8 c13) (heading n6 right)
   goals met: 3 of 9
5. (rotate-first-pass n3 clockwise n6 n7 c8 c14 up right)
   deleted: (node-first-pass-next n3 clockwise n6) (at n7 c8 c14) (heading n7 up)
   added: (node-first-pass-next n3 clockwise n7) (free c8 c14) (heading n7 right)
   goals met: 3 of 9
6. (rotate-first-pass-end n3 clockwise n7 n8 c8 c15)
   deleted: (at n8 c8 c15) (node-first-pass-next n3 clockwise n7)
   added: (free c8 c15) (node-second-pass-next n3)
   goals met: 3 of 9
7. (rotate-second-pass n3 c8 c10 right n4 c9 c10)
   deleted: (node-second-pass-next n3) (free c9 c10)
   added: (node-second-pass-next n4) (at n4 c9 c10)
   goals met: 4 of 9
8. (rotate-second-pass n4 c9 c10 right n5 c10 c10)
   deleted: (node-second-pass-next n4) (free c10 c10)
   added: (node-second-pass-next n5) (at n5 c10 c10)
   goals met: 4 of 9
9. (rotate-second-pass n5 c10 c10 right n6 c11 c10)
   deleted: (node-second-pass-next n5) (free c11 c10)
   added: (node-second-pass-next n6) (at n6 c11 c10)
   goals met: 4 of 9
10. (rotate-second-pass n6 c11 c10 right n7 c12 c10)
   deleted: (node-second-pass-next n6) (free c12 c10)
   added: (node-second-pass-next n7) (at n7 c12 c10)
   goals met: 4 of 9
11. (rotate-second-pass n7 c12 c10 right n8 c13 c10)
   deleted: (node-second-pass-next n7) (free c13 c10)
   added: (node-second-pass-next n8) (at n8 c13 c10)
   goals met: 4 of 9
12. (rotate-second-pass-end n8)
   deleted: (node-second-pass-next n8) (rotating)
   goals met: 5 of 9
13. (rotate n4 clockwise right down)
   deleted: (heading n4 right)
   added: (heading n4 down) (rotating) (node-first-pass-next n4 clockwise n4)
   goals met: 4 of 9
14. (rotate-first-pass n4 clockwise n4 n5 c10 c10 right down)
   deleted: (node-first-pass-next n4 clockwise n4) (at n5 c10 c10) (heading n5 right)
   added: (node-first-pass-next n4 clockwise n5) (free c10 c10) (heading n5 down)
   goals met: 4 of 9
15. (rotate-first-pass n4 clockwise n5 n6 c11 c10 right down)
   deleted: (node-first-pass-next n4 clockwise n5) (at n6 c11 c10) (heading n6 right)
   added: (node-first-pass-next n4 clockwise n6) (free c11 c10) (heading n6 down)
   goals met: 4 of 9
16. (rotate-first-pass n4 clockwise n6 n7 c12 c10 right down)
   deleted: (node-first-pass-next n4 clockwise n6) (at n7 c12 c10) (heading n7 right)
   added: (node-first-pass-next n4 clockwise n7) (free c12 c10) (heading n7 down)
   goals met: 4 of 9
17. (rotate-first-pass-end n4 clockwise n7 n8 c13 c10)
   deleted: (at n8 c13 c10) (node-first-pass-next n4 clockwise n7)
   added: (free c13 c10) (node-second-pass-next n4)
   goals met: 4 of 9
18. (rotate-second-pass n4 c9 c10 down n5 c9 c9)
   deleted: (node-second-pass-next n4) (free c9 c9)
   added: (node-second-pass-next n5) (at n5 c9 c9)
   goals met: 5 of 9
19. (rotate-second-pass n5 c9 c9 down n6 c9 c8)
   deleted: (node-second-pass-next n5) (free c9 c8)
   added: (node-second-pass-next n6) (at n6 c9 c8)
   goals met: 5 of 9
20. (rotate-second-pass n6 c9 c8 down n7 c9 c7)
   deleted: (node-second-pass-next n6) (free c9 c7)
   added: (node-second-pass-next n7) (at n7 c9 c7)
   goals met: 5 of 9
21. (rotate-second-pass n7 c9 c7 down n8 c9 c6)
   deleted: (node-second-pass-next n7) (free c9 c6)
   added: (node-second-pass-next n8) (at n8 c9 c6)
   goals met: 5 of 9
22. (rotate-second-pass-end n8)
   deleted: (node-second-pass-next n8) (rotating)
   goals met: 6 of 9
23. (rotate n5 counterclockwise down right)
   deleted: (heading n5 down)
   added: (heading n5 right) (rotating) (node-first-pass-next n5 counterclockwise n5)
   goals met: 5 of 9
24. (rotate-first-pass n5 counterclockwise n5 n6 c9 c8 down right)
   deleted: (node-first-pass-next n5 counterclockwise n5) (at n6 c9 c8) (heading n6 down)
   added: (node-first-pass-next n5 counterclockwise n6) (free c9 c8) (heading n6 right)
   goals met: 5 of 9
25. (rotate-first-pass n5 counterclockwise n6 n7 c9 c7 down right)
   deleted: (node-first-pass-next n5 counterclockwise n6) (at n7 c9 c7) (heading n7 down)
   added: (node-first-pass-next n5 counterclockwise n7) (free c9 c7) (heading n7 right)
   goals met: 5 of 9
26. (rotate-first-pass-end n5 counterclockwise n7 n8 c9 c6)
   deleted: (at n8 c9 c6) (node-first-pass-next n5 counterclockwise n7)
   added: (free c9 c6) (node-second-pass-next n5)
   goals met: 5 of 9
27. (rotate-second-pass n5 c9 c9 right n6 c10 c9)
   deleted: (node-second-pass-next n5) (free c10 c9)
   added: (node-second-pass-next n6) (at n6 c10 c9)
   goals met: 6 of 9
28. (rotate-second-pass n6 c10 c9 right n7 c11 c9)
   deleted: (node-second-pass-next n6) (free c11 c9)
   added: (node-second-pass-next n7) (at n7 c11 c9)
   goals met: 6 of 9
29. (rotate-second-pass n7 c11 c9 right n8 c12 c9)
   deleted: (node-second-pass-next n7) (free c12 c9)
   added: (node-second-pass-next n8) (at n8 c12 c9)
   goals met: 6 of 9
30. (rotate-second-pass-end n8)
   deleted: (node-second-pass-next n8) (rotating)
   goals met: 7 of 9
31. (rotate n6 clockwise right down)
   deleted: (heading n6 right)
   added: (heading n6 down) (rotating) (node-first-pass-next n6 clockwise n6)
   goals met: 6 of 9
32. (rotate-first-pass n6 clockwise n6 n7 c11 c9 right down)
   deleted: (node-first-pass-next n6 clockwise n6) (at n7 c11 c9) (heading n7 right)
   added: (node-first-pass-next n6 clockwise n7) (free c11 c9) (heading n7 down)
   goals met: 6 of 9
33. (rotate-first-pass-end n6 clockwise n7 n8 c12 c9)
   deleted: (at n8 c12 c9) (node-first-pass-next n6 clockwise n7)
   added: (free c12 c9) (node-second-pass-next n6)
   goals met: 6 of 9
34. (rotate-second-pass n6 c10 c9 down n7 c10 c8)
   deleted: (node-second-pass-next n6) (free c10 c8)
   added: (node-second-pass-next n7) (at n7 c10 c8)
   goals met: 7 of 9
35. (rotate-second-pass n7 c10 c8 down n8 c10 c7)
   deleted: (node-second-pass-next n7) (free c10 c7)
   added: (node-second-pass-next n8) (at n8 c10 c7)
   goals met: 7 of 9
36. (rotate-second-pass-end n8)
   deleted: (node-second-pass-next n8) (rotating)
   goals met: 8 of 9
37. (rotate n7 counterclockwise down right)
   deleted: (heading n7 down)
   added: (heading n7 right) (rotating) (node-first-pass-next n7 counterclockwise n7)
   goals met: 7 of 9
38. (rotate-first-pass-end n7 counterclockwise n7 n8 c10 c7)
   deleted: (at n8 c10 c7) (node-first-pass-next n7 counterclockwise n7)
   added: (free c10 c7) (node-second-pass-next n7)
   goals met: 7 of 9
39. (rotate-second-pass n7 c10 c8 right n8 c11 c8)
   deleted: (node-second-pass-next n7) (free c11 c8)
   added: (node-second-pass-next n8) (at n8 c11 c8)
   goals met: 8 of 9
40. (rotate-second-pass-end n8)
   deleted: (node-second-pass-next n8) (rotating)
   goals met: 9 of 9
